In [23]:
from dotenv import load_dotenv
import os
load_dotenv(override=True, verbose=True)

True

In [24]:
import psycopg2
import psycopg2.extras
import pandas as pd

In [25]:
RDS_DB = os.getenv("DB_NAME")
RDS_USER = os.getenv("DB_USER")
RDS_PASSWORD = os.getenv("DB_PASSWORD")
RDS_HOST = os.getenv("DB_HOST")

In [26]:
print(RDS_HOST)

trumpet.db.elephantsql.com

In [27]:

def get_db_connection() -> psycopg2.extensions.connection:
    """ Create a connection for database postgres Aurora"""
    try:
        conn = psycopg2.connect(f"""
    dbname={RDS_DB}
    user={RDS_USER} 
    password={RDS_PASSWORD}
    host={RDS_HOST}""")
        return conn
    except:
        print("Error connecting to database.")

In [28]:
conn=get_db_connection()

In [29]:
cursor=conn.cursor()

In [30]:
cursor.execute('''SELECT * FROM artist''')

In [31]:
sql = '''SELECT * FROM artwork'''
  
  
cursor.execute(sql)
column_names = [desc[0] for desc in cursor.description]
for i in column_names:
    print(i)
conn.commit()

artwork_id
title
year_completed
department
artist_id

In [32]:
sql = '''SELECT * FROM artist'''
  
  
cursor.execute(sql)
column_names = [desc[0] for desc in cursor.description]
for i in column_names:
    print(i)
conn.commit()

artist_id
artist_name
nationality
gender
year_start
year_end

In [33]:
artist_query=pd.read_sql_query(
    '''
    SELECT 
    * FROM
    artist
    ''',
    conn
)

/var/folders/n3/ffwxys9n7_g_dzzr0q172hp40000gn/T/ipykernel_96887/1321347188.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  artist_query=pd.read_sql_query(

In [34]:
artwork_query=pd.read_sql_query(
    '''
    SELECT 
    * FROM
    artwork
    ''',
    conn
)

/var/folders/n3/ffwxys9n7_g_dzzr0q172hp40000gn/T/ipykernel_96887/2940186248.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  artwork_query=pd.read_sql_query(

In [35]:
artist_df=pd.DataFrame(artist_query, columns=['artist_id','artist_name','nationality','gender','year_start','year_end'])

In [36]:
artwork_df=pd.DataFrame(artwork_query, columns=['artwork_id','title','year_completed','department','artist_id'])

In [37]:
artist_df.sample(10)

     artist_id        artist_name nationality  gender  year_start  year_end
12        3500  Julian Lethbridge     British    Male        1947         0
10        2995       Anish Kapoor     British    Male        1954         0
73       19862     David Shrigley     British    Male        1968         0
87       28097      Wangechi Mutu      Kenyan  Female        1972         0
27        5409      Stephen Shore    American    Male        1947         0
120      33913    Trisha Donnelly    American  Female        1974         0
112      30621        Adrian Paci    Albanian    Male        1969         0
80       26465    Josiah McElheny    American    Male        1966         0
103      28834   Cheyney Thompson    American    Male        1975         0
69        8478  Christian Marclay    American    Male        1955         0

In [38]:
artwork_df.sample(10)

,artwork_id,title,year_completed,department,artist_id
4286,4277,"Untitled (Kunsthalle Zürich (Opening), Switzer...",2007,Drawings & Prints,28858
5788,5789,Twice Sold Object: Ness Book,2004,Drawings & Prints,37145
4663,4652,The Bastard Word,2007,Drawings & Prints,8033
3707,3694,Untitled from Flare,2009,Drawings & Prints,4344
5145,5131,Untitled,2001,Painting & Sculpture,7855
4716,4705,Wp Wp Wp,2014,Drawings & Prints,8033
5678,5679,"Plate (folio 9, verso) from Swimming Home",2013,Drawings & Prints,3016
3359,3349,Untitled (Holiday Laurel),2004,Drawings & Prints,710
2876,2867,Untitled from Coyote Stories,2005,Drawings & Prints,871
5979,5980,Have you seen my language?,2016,Photography,48637

In [39]:
df=pd.merge(artist_df,artwork_df,on='artist_id',how='inner')

In [40]:
df.sample(10)

,artist_id,artist_name,nationality,gender,year_start,year_end,artwork_id,title,year_completed,department
5610,41664,Wael Shawky,Egyptian,Male,1971,0,4762,Untitled (for Parkett no. 95),2014,Drawings & Prints
5065,33915,Huma Bhabha,American,Female,1962,0,1643,Untitled from Reconstructions,2007,Drawings & Prints
1103,710,Louise Bourgeois,American,Female,1911,2010,3572,"Robert, plate 3 of 24, from the series, Self P...",2009,Drawings & Prints
2507,6448,Christopher Wool,American,Male,1955,0,5450,Untitled from a.k.a.,2016,Drawings & Prints
1494,2907,Bill Jensen,American,Male,1945,0,2904,Howl,2011,Drawings & Prints
4710,29689,Fernando Martín Menis,Spanish,Male,1951,0,4027,"Holy Redeemer Church, San Cristóbal de la Lagu...",2005,Architecture & Design
6227,131529,Mustafa Faruki,American,Male,1979,0,6128,Intake Facility for an Anonymous Client,2017,Architecture & Design
5965,49682,Fazal Sheikh,American,Male,1965,0,5215,Independence/Nakba,2013,Photography
4753,30229,Mark Fox,American,Male,1963,0,4065,between,2012,Drawings & Prints
5766,41829,Ben Kinmont,American,Male,1963,0,4797,Student Series: Agency. San Francisco: Antinom...,2012,Drawings & Prints

In [41]:
df = df[df['title'].str.contains('Untitled')==False ]

In [42]:
df.sample(10)

,artist_id,artist_name,nationality,gender,year_start,year_end,artwork_id,title,year_completed,department
6002,49682,Fazal Sheikh,American,Male,1965,0,5253,Independence/Nakba,2013,Photography
5881,48637,Matt Keegan,American,Male,1976,0,5989,Have you seen my language?,2016,Photography
6024,49682,Fazal Sheikh,American,Male,1965,0,5275,Independence/Nakba,2013,Photography
56,710,Louise Bourgeois,American,Female,1911,2010,115,The Guilty Girl Is Fragile,2000,Drawings & Prints
1375,1156,Chuck Close,American,Male,1940,2021,2030,Kara Walker,2008,Photography
1412,2002,Lee Friedlander,American,Male,1934,0,426,Utah,2000,Photography
4503,28762,Gabriele Picco,Italian,Male,1974,0,760,Don't try to live the wrong life,2003,Drawings & Prints
1452,2002,Lee Friedlander,American,Male,1934,0,498,California,2004,Photography
2209,5281,Thomas Schütte,German,Male,1954,0,3139,Low Tide Wandering No. 127 (Wattwanderung No. ...,2001,Drawings & Prints
1258,710,Louise Bourgeois,American,Female,1911,2010,5496,Swelling (#3),2008,Drawings & Prints

In [43]:
print(min(df['year_completed']))

2000

In [47]:
print(list(df['nationality'].unique()))

['American', 'British', 'Italian', 'German', 'Swiss', 'Sudanese', 'Argentine', 'Mexican', 'Portuguese', 'Scottish', 'Brazilian', 'South African', 'Pakistani', 'Polish', 'Belgian', 'Canadian', 'French', 'Colombian', 'Chinese', 'Kenyan', 'Spanish', 'Finnish', 'Cuban', 'Albanian', 'Dutch', 'Indian', 'Korean', 'Cameroonian', 'Egyptian', 'Chilean', 'Native American']